burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_dma.h
#define DMA_CH6CTL(dmax)                   REG32((dmax) + 0x000000A0U)        /*!< DMA channel 6 control register */
#define DMA_CH6CNT(dmax)                   REG32((dmax) + 0x000000A4U)        /*!< DMA channel 6 counter register */
#define DMA_CH6PADDR(dmax)                 REG32((dmax) + 0x000000A8U)        /*!< DMA channel 6 peripheral base address register */
#define DMA_CH6M0ADDR(dmax)                REG32((dmax) + 0x000000ACU)        /*!< DMA channel 6 memory 0 base address register */
#define DMA_CH6M1ADDR(dmax)                REG32((dmax) + 0x000000B0U)        /*!< DMA channel 6 memory 1 base address register */
#define DMA_CH6FCTL(dmax)                  REG32((dmax) + 0x000000B4U)        /*!< DMA channel 6 FIFO control register */

#define DMA_CH7CTL(dmax)                   REG32((dmax) + 0x000000B8U)        /*!< DMA channel 7 control register */
#define DMA_CH7CNT(dmax)                   REG32((dmax) + 0x000000BCU)        /*!< DMA channel 7 counter register */
#define DMA_CH7PADDR(dmax)                 REG32((dmax) + 0x000000C0U)        /*!< DMA channel 7 peripheral base address register */
#define DMA_CH7M0ADDR(dmax)                REG32((dmax) + 0x000000C4U)        /*!< DMA channel 7 memory 0 base address register */
#define DMA_CH7M1ADDR(dmax)                REG32((dmax) + 0x000000C8U)        /*!< DMA channel 7 memory 1 base address register */
#define DMA_CH7FCTL(dmax)                  REG32((dmax) + 0x000000CCU)        /*!< DMA channel 7 FIFO control register */

#define DMA_SSTAT(dmax)                    REG32((dmax) + 0x00000100U)        /*!< DMA security status register */
#define DMA_SSC(dmax)                      REG32((dmax) + 0x00000104U)        /*!< DMA security status clear register */
#define DMA_CH0SCTL(dmax)                  REG32((dmax) + 0x00000108U)        /*!< DMA channel 0 security control register */
#define DMA_CH1SCTL(dmax)                  REG32((dmax) + 0x0000010CU)        /*!< DMA channel 1 security control register */
#define DMA_CH2SCTL(dmax)                  REG32((dmax) + 0x00000110U)        /*!< DMA channel 2 security control register */
#define DMA_CH3SCTL(dmax)                  REG32((dmax) + 0x00000114U)        /*!< DMA channel 3 security control register */
#define DMA_CH4SCTL(dmax)                  REG32((dmax) + 0x00000118U)        /*!< DMA channel 4 security control register */
#define DMA_CH5SCTL(dmax)                  REG32((dmax) + 0x0000011CU)        /*!< DMA channel 5 security control register */
#define DMA_CH6SCTL(dmax)                  REG32((dmax) + 0x00000120U)        /*!< DMA channel 6 security control register */
#define DMA_CH7SCTL(dmax)                  REG32((dmax) + 0x00000124U)        /*!< DMA channel 7 security control register */

/* bits definitions */
/* DMA_INTF */
#define DMA_INTF_FEEIF                     BIT(0)                             /*!< FIFO error and exception flag */
#define DMA_INTF_SDEIF                     BIT(2)                             /*!< single data mode exception flag */
#define DMA_INTF_TAEIF                     BIT(3)                             /*!< transfer access error flag */
#define DMA_INTF_HTFIF                     BIT(4)                             /*!< half transfer finish flag */
#define DMA_INTF_FTFIF                     BIT(5)                             /*!< full transger finish flag */

/* DMA_INTC */
#define DMA_INTC_FEEIFC                    BIT(0)                             /*!< clear FIFO error and exception flag */
#define DMA_INTC_SDEIFC                    BIT(2)                             /*!< clear single data mode exception flag */
#define DMA_INTC_TAEIFC                    BIT(3)                             /*!< clear single data mode exception flag */
#define DMA_INTC_HTFIFC                    BIT(4)                             /*!< clear half transfer finish flag */
#define DMA_INTC_FTFIFC                    BIT(5)                             /*!< clear full transger finish flag */

/* DMA_CHxCTL,x=0..7 */
#define DMA_CHXCTL_CHEN                    BIT(0)                             /*!< channel x enable */
#define DMA_CHXCTL_SDEIE                   BIT(1)                             /*!< enable bit for channel x single data mode exception interrupt */
#define DMA_CHXCTL_TAEIE                   BIT(2)                             /*!< enable bit for channel x tranfer access error interrupt */
#define DMA_CHXCTL_HTFIE                   BIT(3)                             /*!< enable bit for channel x half transfer finish interrupt */
#define DMA_CHXCTL_FTFIE                   BIT(4)                             /*!< enable bit for channel x full transfer finish interrupt */
#define DMA_CHXCTL_TFCS                    BIT(5)                             /*!< transfer flow controller select */
#define DMA_CHXCTL_TM                      BITS(6,7)                          /*!< transfer mode */
#define DMA_CHXCTL_CMEN                    BIT(8)                             /*!< circulation mode */
#define DMA_CHXCTL_PNAGA                   BIT(9)                             /*!< next address generation algorithm of peripheral */
#define DMA_CHXCTL_MNAGA                   BIT(10)                            /*!< next address generation algorithm of memory */
#define DMA_CHXCTL_PWIDTH                  BITS(11,12)                        /*!< transfer width of peipheral */
#define DMA_CHXCTL_MWIDTH                  BITS(13,14)                        /*!< transfer width of memory */
#define DMA_CHXCTL_PAIF                    BIT(15)                            /*!< peripheral address increment fixed */
#define DMA_CHXCTL_PRIO                    BITS(16,17)                        /*!< priority level */
#define DMA_CHXCTL_SBMEN                   BIT(18)                            /*!< switch-buffer mode enable */
#define DMA_CHXCTL_MBS                     BIT(19)                            /*!< memory buffer select */
#define DMA_CHXCTL_PBURST                  BITS(21,22)                        /*!< transfer burst type of peripheral */
#define DMA_CHXCTL_MBURST                  BITS(23,24)                        /*!< transfer burst type of memory */
#define DMA_CHXCTL_PERIEN                  BITS(25,27)                        /*!< peripheral enable */
#if defined (GD32F5HC)
#define DMA_CHXCTL_RREN                    BIT(28)                            /*!< round-robin group arbitration for "ultra high" priority level channels enable */
#endif

/* DMA_CHxCNT,x=0..7 */
#define DMA_CHXCNT_CNT                     BITS(0,15)                         /*!< transfer counter */

/* DMA_CHxPADDR,x=0..7 */
#define DMA_CHXPADDR_PADDR                 BITS(0,31)                         /*!< peripheral base address */

/* DMA_CHxM0ADDR,x=0..7 */
#define DMA_CHXM0ADDR_M0ADDR               BITS(0,31)                         /*!< memory 0 base address */

/* DMA_CHxM1ADDR,x=0..7 */
#define DMA_CHXM1ADDR_M0ADDR               BITS(0,31)                         /*!< memory 1 base address */

/* DMA_CHxFCTL,x=0..7 */
#define DMA_CHXFCTL_FCCV                   BITS(0,1)                          /*!< FIFO counter critical value */
#define DMA_CHXFCTL_MDMEN                  BIT(2)                             /*!< multi-data mode enable */
#define DMA_CHXFCTL_FCNT                   BITS(3,5)                          /*!< FIFO counter */
#define DMA_CHXFCTL_FEEIE                  BIT(7)                             /*!< FIFO exception interrupt enable */

/* DMA_SSTAT */
#define DMA_SSTAT_IAIF0                    BIT(0)                             /*!< channel0 illegal access interrupt flag */
#define DMA_SSTAT_IAIF1                    BIT(1)                             /*!< channel1 illegal access interrupt flag */
#define DMA_SSTAT_IAIF2                    BIT(2)                             /*!< channel2 illegal access interrupt flag */
#define DMA_SSTAT_IAIF3                    BIT(3)                             /*!< channel3 illegal access interrupt flag */
#define DMA_SSTAT_IAIF4                    BIT(4)                             /*!< channel4 illegal access interrupt flag */
#define DMA_SSTAT_IAIF5                    BIT(5)                             /*!< channel5 illegal access interrupt flag */
#define DMA_SSTAT_IAIF6                    BIT(6)                             /*!< channel6 illegal access interrupt flag */
#define DMA_SSTAT_IAIF7                    BIT(7)                             /*!< channel7 illegal access interrupt flag */

/* DMA_SSC */
#define DMA_SSC_CIAIF0                     BIT(0)                             /*!< clear channel0 illegal access interrupt flag */
#define DMA_SSC_CIAIF1                     BIT(1)                             /*!< clear channel1 illegal access interrupt flag */
#define DMA_SSC_CIAIF2                     BIT(2)                             /*!< clear channel2 illegal access interrupt flag */
#define DMA_SSC_CIAIF3                     BIT(3)                             /*!< clear channel3 illegal access interrupt flag */
#define DMA_SSC_CIAIF4                     BIT(4)                             /*!< clear channel4 illegal access interrupt flag */
#define DMA_SSC_CIAIF5                     BIT(5)                             /*!< clear channel5 illegal access interrupt flag */
#define DMA_SSC_CIAIF6                     BIT(6)                             /*!< clear channel6 illegal access interrupt flag */
#define DMA_SSC_CIAIF7                     BIT(7)                             /*!< clear channel7 illegal access interrupt flag */

/* DMA_CHxSCTL,x=0..7 */
#define DMA_CHXSCTL_SECM                   BIT(0)                             /*!< secure mode */
#define DMA_CHXSCTL_SSEC                   BIT(1)                             /*!< security of the DMA transfer from the source */
#define DMA_CHXSCTL_DSEC                   BIT(2)                             /*!< security of the DMA transfer to the destination */
#define DMA_CHXSCTL_PRIV                   BIT(3)                             /*!< privileged mode */

/* constants definitions */
/* DMA channel select */
typedef enum 
{
    DMA_CH0 = 0,                                    /*!< DMA Channel 0 */
    DMA_CH1,                                        /*!< DMA Channel 1 */
    DMA_CH2,                                        /*!< DMA Channel 2 */
    DMA_CH3,                                        /*!< DMA Channel 3 */
    DMA_CH4,                                        /*!< DMA Channel 4 */
    DMA_CH5,                                        /*!< DMA Channel 5 */
    DMA_CH6,                                        /*!< DMA Channel 6 */
    DMA_CH7                                         /*!< DMA Channel 7 */
} dma_channel_enum;

/* DMA peripheral select */
typedef enum 
{
    DMA_SUBPERI0 = 0,                               /*!< DMA Peripheral 0 */
    DMA_SUBPERI1,                                   /*!< DMA Peripheral 1 */
    DMA_SUBPERI2,                                   /*!< DMA Peripheral 2 */
    DMA_SUBPERI3,                                   /*!< DMA Peripheral 3 */
    DMA_SUBPERI4,                                   /*!< DMA Peripheral 4 */
    DMA_SUBPERI5,                                   /*!< DMA Peripheral 5 */
    DMA_SUBPERI6,                                   /*!< DMA Peripheral 6 */
    DMA_SUBPERI7                                    /*!< DMA Peripheral 7 */
} dma_subperipheral_enum;

/* DMA multidata mode initialize struct */
typedef struct
{
    uint32_t periph_addr;                           /*!< peripheral base address */
    uint32_t periph_width;                          /*!< transfer data size of peripheral */
    uint32_t periph_inc;                            /*!< peripheral increasing mode */  

    uint32_t memory0_addr;                          /*!< memory 0 base address */
    uint32_t memory_width;                          /*!< transfer data size of memory */
    uint32_t memory_inc;                            /*!< memory increasing mode */

    uint32_t memory_burst_width;                    /*!< multi data mode enable */
    uint32_t periph_burst_width;                    /*!< multi data mode enable */
    uint32_t critical_value;                        /*!< FIFO critical */

    uint32_t circular_mode;                         /*!< DMA circular mode */
    uint32_t direction;                             /*!< channel data transfer direction */
    uint32_t number;                                /*!< channel transfer number */
    uint32_t priority;                              /*!< channel priority level */
}dma_multi_data_parameter_struct;

