burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_dma.h
/* DMA flow controller select */
#define DMA_FLOW_CONTROLLER_DMA            ((uint32_t)0x00000000U)                   /*!< DMA is the flow controler */
#define DMA_FLOW_CONTROLLER_PERI           ((uint32_t)0x00000001U)                   /*!< peripheral is the flow controler */

/* peripheral increasing mode */
#define DMA_PERIPH_INCREASE_ENABLE         ((uint32_t)0x00000000U)                   /*!< next address of peripheral is increasing address mode */
#define DMA_PERIPH_INCREASE_DISABLE        ((uint32_t)0x00000001U)                   /*!< next address of peripheral is fixed address mode */
#define DMA_PERIPH_INCREASE_FIX            ((uint32_t)0x00000002U)                   /*!< next address of peripheral is increasing fixed */

/* memory increasing mode */
#define DMA_MEMORY_INCREASE_ENABLE         ((uint32_t)0x00000000U)                   /*!< next address of memory is increasing address mode */
#define DMA_MEMORY_INCREASE_DISABLE        ((uint32_t)0x00000001U)                   /*!< next address of memory is fixed address mode */

/* FIFO status */
#define DMA_FIFO_STATUS_NODATA             ((uint32_t)0x00000000U)                   /*!< the data in the FIFO less than 1 word */
#define DMA_FIFO_STATUS_1_WORD             ((uint32_t)0x00000001U)                   /*!< the data in the FIFO more than 1 word, less than 2 words */
#define DMA_FIFO_STATUS_2_WORD             ((uint32_t)0x00000002U)                   /*!< the data in the FIFO more than 2 word, less than 3 words */
#define DMA_FIFO_STATUS_3_WORD             ((uint32_t)0x00000003U)                   /*!< the data in the FIFO more than 3 word, less than 4 words */
#define DMA_FIFO_STATUS_EMPTY              ((uint32_t)0x00000004U)                   /*!< the data in the FIFO is empty */
#define DMA_FIFO_STATUS_FULL               ((uint32_t)0x00000005U)                   /*!< the data in the FIFO is full */

/* DMA reset value */
#define DMA_CHCTL_RESET_VALUE              ((uint32_t)0x00000000U)                   /*!< the reset value of DMA channel CHXCTL register */
#define DMA_CHCNT_RESET_VALUE              ((uint32_t)0x00000000U)                   /*!< the reset value of DMA channel CHXCNT register */
#define DMA_CHPADDR_RESET_VALUE            ((uint32_t)0x00000000U)                   /*!< the reset value of DMA channel CHXPADDR register */
#define DMA_CHMADDR_RESET_VALUE            ((uint32_t)0x00000000U)                   /*!< the reset value of DMA channel CHXMADDR register */
#define DMA_CHINTF_RESET_VALUE             ((uint32_t)0x0000003DU)                   /*!< clear DMA channel CHXINTFS register */
#define DMA_CHFCTL_RESET_VALUE             ((uint32_t)0x00000021U)                   /*!< the reset value of DMA channel CHXFCTL register */

/* DMA_INTF register */
/* DMA flag bits */
#define DMA_FLAG_FEE                       DMA_INTF_FEEIF                            /*!< FIFO error and exception flag */
#define DMA_FLAG_SDE                       DMA_INTF_SDEIF                            /*!< single data mode exception flag */
#define DMA_FLAG_TAE                       DMA_INTF_TAEIF                            /*!< transfer access error flag */
#define DMA_FLAG_HTF                       DMA_INTF_HTFIF                            /*!< half transfer finish flag */
#define DMA_FLAG_FTF                       DMA_INTF_FTFIF                            /*!< full transger finish flag */

/* interrupt flag bits */
#define DMA_INT_FLAG_FEE                   DMA_INTF_FEEIF                            /*!< FIFO error and exception interrupt flag */
#define DMA_INT_FLAG_SDE                   DMA_INTF_SDEIF                            /*!< single data mode exception interrupt flag */
#define DMA_INT_FLAG_TAE                   DMA_INTF_TAEIF                            /*!< transfer access error interrupt flag */
#define DMA_INT_FLAG_HTF                   DMA_INTF_HTFIF                            /*!< half transfer finish interrupt flag */
#define DMA_INT_FLAG_FTF                   DMA_INTF_FTFIF                            /*!< full transger finish interrupt flag */

/* interrupt enable bits */
#define DMA_INT_SDE                        DMA_CHXCTL_SDEIE                          /* single data mode exception interrupt enable */
#define DMA_INT_TAE                        DMA_CHXCTL_TAEIE                          /* tranfer access error interrupt enable */
#define DMA_INT_HTF                        DMA_CHXCTL_HTFIE                          /* half transfer finish interrupt enable */
#define DMA_INT_FTF                        DMA_CHXCTL_FTFIE                          /* full transfer finish interrupt enable */
#define DMA_INT_FEE                        DMA_CHXFCTL_FEEIE                         /* FIFO exception interrupt enable */

/* DMA security */
#define DMA_CHANNEL_SECURE                 DMA_CHXSCTL_SECM                          /*!< the secure mode of DMA channel */
#define DMA_CHANNEL_NONSECURE              ((uint32_t)0x00000000U)                   /*!< the non-secure mode of DMA channel */
#define DMA_CHANNEL_SOURCE_SECURE          DMA_CHXSCTL_SSEC                          /*!< the secure DMA transfer from the source */
#define DMA_CHANNEL_SOURCE_NONSECURE       ((uint32_t)0x00000000U)                   /*!< the non-secure DMA transfer from the source */
#define DMA_CHANNEL_DESTINATION_SECURE     DMA_CHXSCTL_DSEC                          /*!< the secure DMA transfer to the destination */
#define DMA_CHANNEL_DESTINATION_NONSECURE  ((uint32_t)0x00000000U)                   /*!< the non-secure DMA transfer to the destination */

/* DMA privilege */
#define DMA_CHANNEL_PRIV                   DMA_CHXSCTL_PRIV                          /*!< the privileged mode of DMA channel */
#define DMA_CHANNEL_NONPRIV                ((uint32_t)0x00000000U)                   /*!< the non-privileged mode of DMA channel */

/* function declarations */
/* DMA deinitialization and initialization functions */
/* deinitialize DMA a channel registers */
void dma_deinit(uint32_t dma_periph, dma_channel_enum channelx);
/* initialize the DMA single data mode parameters struct with the default values */
void dma_single_data_para_struct_init(dma_single_data_parameter_struct* init_struct);
/* initialize the DMA multi data mode parameters struct with the default values */
void dma_multi_data_para_struct_init(dma_multi_data_parameter_struct* init_struct);
/* DMA single data mode initialize */
void dma_single_data_mode_init(uint32_t dma_periph, dma_channel_enum channelx, dma_single_data_parameter_struct* init_struct);
/* DMA multi data mode initialize */
void dma_multi_data_mode_init(uint32_t dma_periph, dma_channel_enum channelx, dma_multi_data_parameter_struct* init_struct);

/* DMA configuration functions */
/* set DMA peripheral base address */
void dma_periph_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t address);
/* set DMA Memory base address */
void dma_memory_address_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t memory_flag, uint32_t address);
/* set the number of remaining data to be transferred by the DMA */
void dma_transfer_number_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t number);
/* get the number of remaining data to be transferred by the DMA */
uint32_t dma_transfer_number_get(uint32_t dma_periph, dma_channel_enum channelx);
/* configure priority level of DMA channel */
void dma_priority_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t priority);
/* configure transfer burst beats of memory */
void dma_memory_burst_beats_config (uint32_t dma_periph, dma_channel_enum channelx, uint32_t mbeat);
/* configure transfer burst beats of peripheral */
void dma_periph_burst_beats_config (uint32_t dma_periph, dma_channel_enum channelx, uint32_t pbeat);
/* configure transfer data size of memory */
void dma_memory_width_config (uint32_t dma_periph, dma_channel_enum channelx, uint32_t msize);
/* configure transfer data size of peripheral */
void dma_periph_width_config (uint32_t dma_periph, dma_channel_enum channelx, uint32_t psize);

/* configure next address increasement algorithm of memory */
void dma_memory_address_generation_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t generation_algorithm);
/* configure next address increasement algorithm of peripheral */
void dma_peripheral_address_generation_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t generation_algorithm);

/* enable DMA circulation mode */
void dma_circulation_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA circulation mode */
void dma_circulation_disable(uint32_t dma_periph, dma_channel_enum channelx);
/* enable DMA channel */
void dma_channel_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA channel */
void dma_channel_disable(uint32_t dma_periph, dma_channel_enum channelx);

/* configure the direction of data transfer on the channel */
void dma_transfer_direction_config(uint32_t dma_periph, dma_channel_enum channelx, uint8_t direction);
/* configure DMA switch buffer mode */
void dma_switch_buffer_mode_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t memory1_addr, uint32_t memory_select);
/* get the current buffer used by the DMA */
uint32_t dma_using_memory_get(uint32_t dma_periph, dma_channel_enum channelx);
/* select DMA channel peripheral */
void dma_channel_subperipheral_select(uint32_t dma_periph, dma_channel_enum channelx, dma_subperipheral_enum sub_periph);
/* configure DMA flow controller */
void dma_flow_controller_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t controller);
/* enable DMA switch buffer mode */
void dma_switch_buffer_mode_enable(uint32_t dma_periph, dma_channel_enum channelx);
/* disable DMA switch buffer mode */
void dma_switch_buffer_mode_disable(uint32_t dma_periph, dma_channel_enum channelx);
#if defined (GD32F5HC)
/* enable round-robin group arbitration for "ultra high" priority level channels */
void dma_round_robin_group_arbitration_enable(uint32_t dma_periph);
/* disable round-robin group arbitration for "ultra high" priority level channels */
void dma_round_robin_group_arbitration_disable(uint32_t dma_periph);
#endif
/* get DMA FIFO status */
uint32_t dma_fifo_status_get(uint32_t dma_periph, dma_channel_enum channelx);

