burakenez/gd32w51x-cmake-vscode/Drivers/GD32W51x_F5HC_standard_peripheral/Include/gd32w51x_f5hc_dma.h
/* flag and interrupt functions */
/* check the designated flag of a DMA channel is set or not */
FlagStatus dma_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t flag);
/* clear the designated flag of a DMA channel */
void dma_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t flag);
/* check the designated interrupt flag of a DMA channel is set or not */
FlagStatus dma_interrupt_flag_get(uint32_t dma_periph, dma_channel_enum channelx, uint32_t int_flag);
/* clear the designated interrupt flag of a DMA channel */
void dma_interrupt_flag_clear(uint32_t dma_periph, dma_channel_enum channelx, uint32_t int_flag);
/* enable DMA interrupt */
void dma_interrupt_enable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t source);
/* disable DMA interrupt */
void dma_interrupt_disable(uint32_t dma_periph, dma_channel_enum channelx, uint32_t source);

/* DMA security configuration functions */
/* configure secure attribution of DMA channel */
void dma_security_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t security);
/* configure privileged mode of DMA channel */
void dma_priv_config(uint32_t dma_periph, dma_channel_enum channelx, uint32_t priv);
/* check DMA channel illegal flag is set or not */
FlagStatus dma_illegal_access_flag_get(uint32_t dma_periph, dma_channel_enum channelx);
/* clear DMA channel illegal flag */
void dma_illegal_access_flag_clear(uint32_t dma_periph, dma_channel_enum channelx);
#endif /* gd32w51x_f5hc_DMA_H */
